Revit 2027 API
SpaceSet.Insert Method
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Space item
)
Public Overridable Function Insert (
	item As Space
) As Boolean
public:
virtual bool Insert(
	Space^ item
)
abstract Insert :
        item : Space -> bool
override Insert :
        item : Space -> bool
Parameters
item Space
Return Value
Boolean
See Also
Reference
SpaceSet Class
Autodesk.Revit.DB.Mechanical Namespace